tiborsimon/embedded-tdd-headers/pic/8bit/pic18f8720_tdd.h
#define TRISE_RE2                     522
#define TRISE_RE3                     523
#define TRISE3                        524
#define TRISE_RE4                     525
#define TRISE4                        526
#define TRISE_RE5                     527
#define TRISE5                        528
#define TRISE_RE6                     529
#define TRISE6                        530
#define TRISE_RE7                     531
#define TRISE7                        532
#define TRISF                         533
#define TRISF0                        534
#define TRISF_RF0                     535
#define TRISF_RF1                     536
#define TRISF1                        537
#define TRISF_RF2                     538
#define TRISF2                        539
#define TRISF3                        540
#define TRISF_RF3                     541
#define TRISF_RF4                     542
#define TRISF4                        543
#define TRISF_RF5                     544
#define TRISF5                        545
#define TRISF_RF6                     546
#define TRISF6                        547
#define TRISF7                        548
#define TRISF_RF7                     549
#define TRISG                         550
#define TRISG0                        551
#define TRISG_RG0                     552
#define TRISG1                        553
#define TRISG_RG1                     554
#define TRISG2                        555
#define TRISG_RG2                     556
#define TRISG_RG3                     557
#define TRISG3                        558
#define TRISG4                        559
#define TRISG_RG4                     560
#define TRISH                         561
#define TRISH_RH0                     562
#define TRISH0                        563
#define TRISH_RH1                     564
#define TRISH1                        565
#define TRISH_RH2                     566
#define TRISH2                        567
#define TRISH_RH3                     568
#define TRISH3                        569
#define TRISH_RH4                     570
#define TRISH4                        571
#define TRISH_RH5                     572
#define TRISH5                        573
#define TRISH_RH6                     574
#define TRISH6                        575
#define TRISH_RH7                     576
#define TRISH7                        577
#define TRISJ                         578
#define TRISJ_RJ0                     579
#define TRISJ0                        580
#define TRISJ_RJ1                     581
#define TRISJ1                        582
#define TRISJ_RJ2                     583
#define TRISJ2                        584
#define TRISJ_RJ3                     585
#define TRISJ3                        586
#define TRISJ_RJ4                     587
#define TRISJ4                        588
#define TRISJ_RJ5                     589
#define TRISJ5                        590
#define TRISJ_RJ6                     591
#define TRISJ6                        592
#define TRISJ_RJ7                     593
#define TRISJ7                        594
#define MEMCON                        595
#define WM                            596
#define WM0                           597
#define WM1                           598
#define WAIT0                         599
#define WAIT                          600
#define WAIT1                         601
#define EBDIS                         602
#define PIE1                          603
#define TMR1IE                        604
#define TMR2IE                        605
#define CCP1IE                        606
#define SSPIE                         607
#define TXIE                          608
#define TX1IE                         609
#define RCIE                          610
#define RC1IE                         611
#define ADIE                          612
#define PSPIE                         613
#define PIR1                          614
#define TMR1IF                        615
#define TMR2IF                        616
#define CCP1IF                        617
#define SSPIF                         618
#define TXIF                          619
#define TX1IF                         620
#define RCIF                          621
#define RC1IF                         622
#define ADIF                          623
#define PSPIF                         624
#define IPR1                          625
#define TMR1IP                        626
#define TMR2IP                        627
#define CCP1IP                        628
#define SSPIP                         629
#define TX1IP                         630
#define TXIP                          631
#define RC1IP                         632
#define RCIP                          633
#define ADIP                          634
#define PSPIP                         635
#define PIE2                          636
#define CCP2IE                        637
#define TMR3IE                        638
#define LVDIE                         639
#define BCLIE                         640
#define EEIE                          641
#define CMIE                          642
#define PIR2                          643
#define CCP2IF                        644
#define TMR3IF                        645
#define LVDIF                         646
#define BCLIF                         647
#define EEIF                          648
#define CMIF                          649
#define IPR2                          650
#define CCP2IP                        651
#define TMR3IP                        652
#define LVDIP                         653
#define BCLIP                         654
#define EEIP                          655
#define CMIP                          656
#define PIE3                          657
#define CCP3IE                        658
#define RXB0IE                        659
#define RXBNIE                        660
#define RXB1IE                        661
#define CCP4IE                        662
#define TXB0IE                        663
#define CCP5IE                        664
#define TMR4IE                        665
#define TXB1IE                        666
#define TXB2IE                        667
#define TXBNIE                        668
#define TX2IE                         669
#define RC2IE                         670
#define PIR3                          671
#define CCP3IF                        672
#define RXBNIF                        673
#define CCP4IF                        674
#define CCP5IF                        675
#define TMR4IF                        676
#define TXBNIF                        677
#define TX2IF                         678
#define RC2IF                         679
#define IPR3                          680
#define CCP3IP                        681
#define CCP4IP                        682
#define RXBNIP                        683
#define CCP5IP                        684
#define TMR4IP                        685
#define TX2IP                         686
#define TXBNIP                        687
#define RC2IP                         688
#define EECON1                        689
#define EECON1_RD                     690
#define EECON1_WR                     691
#define WREN                          692
#define WRERR                         693
#define FREE                          694
#define CFGS                          695
#define EEFS                          696
#define EEPGD                         697
#define RCSTA1                        698
#define RCSTA1_RX9D                   699
#define RX9D1                         700
#define RCSTA1_RCD8                   701
#define RCSTA1_OERR                   702
#define OERR1                         703
#define RCSTA1_FERR                   704
#define FERR1                         705
#define RCSTA1_ADDEN                  706
#define RCSTA1_ADEN                   707
#define ADDEN1                        708
#define RCSTA1_CREN                   709
#define CREN1                         710
#define SRENA                         711
#define SREN1                         712
#define RCSTA1_SREN                   713
#define RCSTA1_NOT_RC8                714
#define RCSTA1_RC9                    715
#define RCSTA1_nRC8                   716
#define RCSTA1_RC8_9                  717
#define RCSTA1_RX9                    718
#define RX91                          719
#define RCSTA1_SPEN                   720
#define SPEN1                         721
#define TXSTA1                        722
#define TX9D1                         723
#define TXSTA1_TX9D                   724
#define TXSTA1_TXD8                   725
#define TRMT1                         726
#define TXSTA1_TRMT                   727
#define BRGH1                         728
#define TXSTA1_BRGH                   729
#define SENDB1                        730
#define SENDB                         731
#define TXSTA1_SYNC                   732
#define SYNC1                         733
#define TXEN1                         734
#define TXSTA1_TXEN                   735
#define TX91                          736
#define TXSTA1_NOT_TX8                737
#define TXSTA1_TX8_9                  738
#define TXSTA1_TX9                    739
#define TXSTA1_nTX8                   740
#define TXSTA1_CSRC                   741
#define CSRC1                         742
#define PSPCON                        743
#define PSPMODE                       744
#define IBOV                          745
#define OBF                           746
#define IBF                           747
#define T3CON                         748
#define TMR3ON                        749
#define TMR3CS                        750
#define nT3SYNC                       751
#define T3NSYNC                       752
#define NOT_T3SYNC                    753
#define T3SYNC                        754
#define T3INSYNC                      755
#define SOSCEN3                       756
#define T3CCP1                        757
#define T3CKPS                        758
#define T3CKPS0                       759
#define T3CKPS1                       760
#define T3CCP2                        761
#define T3CON_RD16                    762
#define RD163                         763
#define T3RD16                        764
#define CMCON                         765
#define CM                            766
#define CMEN0                         767
#define CM0                           768
#define CMEN1                         769
#define CM1                           770
#define CMEN2                         771
#define CM2                           772
#define CIS                           773
#define C1INV                         774
#define C2INV                         775
#define CMCON_C1OUT                   776
#define CMCON_C2OUT                   777
#define CVRCON                        778
#define CVR                           779
#define CVR0                          780
#define CVR1                          781
#define CVR2                          782
#define CVR3                          783
#define CVRCON_CVREF                  784
#define CVRSS                         785
#define CVRR                          786
#define CVROEN                        787
#define CVROE                         788
#define CVREN                         789
#define CCP3CON                       790
#define CCP3M                         791
#define CCP3M0                        792
#define CCP3M1                        793
#define CCP3M2                        794
#define CCP3M3                        795
#define DCCP3Y                        796
#define DC3B                          797
#define DC3B0                         798
#define DC3B1                         799
#define DCCP3X                        800
#define CCP2CON                       801
#define CCP2M                         802
#define CCP2M0                        803
#define CCP2M1                        804
#define CCP2M2                        805
#define CCP2M3                        806
#define DC2B0                         807
#define DCCP2Y                        808
#define CCP2Y                         809
#define DC2B                          810
#define DC2B1                         811
#define DCCP2X                        812
#define CCP2X                         813
#define CCP1CON                       814
#define CCP1M0                        815
#define CCP1M                         816
#define CCP1M1                        817
#define CCP1M2                        818
#define CCP1M3                        819
#define DCCP1Y                        820
#define CCP1Y                         821
#define DC1B                          822
#define DC1B0                         823
#define CCP1X                         824
#define DCCP1X                        825
#define DC1B1                         826
#define ADCON2                        827
#define ADCS                          828
#define ADCS0                         829
#define ADCS1                         830
#define ADCS2                         831
#define ADFM                          832
#define ADCON1                        833
#define PCFG0                         834
#define PCFG                          835
#define PCFG1                         836
#define PCFG2                         837
#define CHSN3                         838
#define PCFG3                         839
#define VCFG                          840
#define VCFG0                         841
#define VCFG01                        842
#define VCFG11                        843
#define VCFG1                         844
#define ADCON0                        845
#define ADON                          846
#define nDONE                         847
#define GO_nDONE                      848
#define NOT_DONE                      849
#define GODONE                        850
#define GO_DONE                       851
#define DONE                          852
#define GO_NOT_DONE                   853
#define GO                            854
#define CHS0                          855
#define CHS                           856
#define CHS1                          857
#define CHS2                          858
#define CHS3                          859
#define SSPCON2                       860
#define SEN                           861
#define RSEN                          862
#define PEN                           863
#define RCEN                          864
#define ACKEN                         865
#define ACKDT                         866
#define ACKSTAT                       867
#define GCEN                          868
#define SSPCON1                       869
#define SSPM0                         870
#define SSPM                          871
#define SSPM1                         872
#define SSPM2                         873
#define SSPM3                         874
#define CKP                           875
#define SSPEN                         876
#define SSPOV                         877
#define WCOL                          878
#define SSPSTAT                       879
#define BF                            880
#define UA                            881
#define R_NOT_W                       882
#define READ_WRITE                    883
#define NOT_W                         884
#define R_W                           885
#define nW                            886
#define RW                            887
#define nWRITE                        888
#define R                             889
#define NOT_WRITE                     890
#define R_nW                          891
#define I2C_READ                      892
#define START                         893
#define S                             894
#define I2C_START                     895
#define STOP                          896
#define I2C_STOP                      897
#define P                             898
#define NOT_A                         899
#define DATA_ADDRESS                  900
#define nA                            901
#define D_A                           902
#define D_nA                          903
#define D                             904
#define DA                            905
#define D_NOT_A                       906
#define NOT_ADDRESS                   907
#define nADDRESS                      908
#define I2C_DAT                       909
#define CKE                           910
#define SMP                           911
#define T2CON                         912
#define T2CKPS0                       913
#define T2CKPS                        914
#define T2CKPS1                       915
#define TMR2ON                        916
#define T2OUTPS0                      917
#define T2OUTPS                       918
#define T2OUTPS1                      919
#define T2OUTPS2                      920
#define T2OUTPS3                      921
#define T1CON                         922
#define TMR1ON                        923
#define TMR1CS                        924
#define NOT_T1SYNC                    925
#define T1SYNC                        926
#define nT1SYNC                       927
#define T1INSYNC                      928
#define T1OSCEN                       929
#define SOSCEN                        930
#define T1CKPS0                       931
#define T1CKPS                        932
#define T1CKPS1                       933
#define T1RD16                        934
#define T1CON_RD16                    935
#define RCON                          936
#define BOR                           937
#define NOT_BOR                       938
#define nBOR                          939
#define POR                           940
#define nPOR                          941
#define NOT_POR                       942
#define nPD                           943
#define NOT_PD                        944
#define PD                            945
#define NOT_TO                        946
#define nTO                           947
#define TO                            948
#define nRI                           949
#define NOT_RI                        950
#define RI                            951
#define nIPEN                         952
#define IPEN                          953
#define NOT_IPEN                      954
#define WDTCON                        955
#define SWDTE                         956
#define SWDTEN                        957
#define LVDCON                        958
#define LVV0                          959
#define LVDL0                         960
#define LVDL                          961
#define LVV1                          962
#define LVDL1                         963
#define LVV2                          964
#define LVDL2                         965
#define LVV3                          966
#define LVDL3                         967
#define LVDEN                         968
#define BGST                          969
#define IRVST                         970
#define OSCCON                        971
#define SCS                           972
#define T0CON                         973
#define T0PS                          974
#define T0PS0                         975
#define T0PS1                         976
#define T0PS2                         977
#define PSA                           978
#define T0SE                          979
#define T0CS                          980
#define T08BIT                        981
#define TMR0ON                        982
#define STATUS                        983
#define C                             984
#define CARRY                         985
#define DC                            986
#define ZERO                          987
#define Z                             988
#define OV                            989
#define OVERFLOW                      990
#define N                             991
#define NEGATIVE                      992
#define INTCON3                       993
#define INT1IF                        994
#define INT1F                         995
#define INT2IF                        996
#define INT2F                         997
#define INT3F                         998
#define INT3IF                        999
#define INT1E                         1000
#define INT1IE                        1001
#define INT2IE                        1002
#define INT2E                         1003
#define INT3E                         1004
#define INT3IE                        1005
#define INT1P                         1006
#define INT1IP                        1007
#define INT2IP                        1008
#define INT2P                         1009
#define INTCON2                       1010
#define RBIP                          1011
#define INT3IP                        1012
#define INT3P                         1013
#define TMR0IP                        1014
#define T0IP                          1015
#define INTEDG3                       1016
#define INTEDG2                       1017
#define INTEDG1                       1018
#define INTEDG0                       1019
#define RBPU                          1020
#define NOT_RBPU                      1021
#define nRBPU                         1022
#define INTCON                        1023
#define RBIF                          1024
#define INT0F                         1025
#define INT0IF                        1026
#define T0IF                          1027
#define TMR0IF                        1028
#define RBIE                          1029
#define INT0E                         1030
#define INT0IE                        1031
#define T0IE                          1032
#define TMR0IE                        1033
#define PEIE                          1034
#define PEIE_GIEL                     1035
#define GIEL                          1036
#define GIE_GIEH                      1037
#define GIE                           1038
#define GIEH                          1039
#define STKPTR0                       1040
#define STKPTR                        1041
#define SP0                           1042
#define STKPTR1                       1043
#define SP1                           1044
#define STKPTR2                       1045
#define SP2                           1046
#define SP3                           1047
#define STKPTR3                       1048
#define STKPTR4                       1049
#define SP4                           1050
#define STKUNF                        1051
#define STKOVF                        1052
#define STKFUL                        1053

#endif // _PIC18F8720_H_
